src/InformationRegisters/scmОчередьЗапросовЧатБота/scmОчередьЗапросовЧатБота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>scmОчередьЗапросовЧатБота</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>message_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>update_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>first_last_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>48</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>chat_text</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>bot_answer</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>error</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>user</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>state</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>48</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>token</name>
    <type>
      <types>CatalogRef.scmВнешниеСервисы_ПараметрыСоединения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>chat_id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/scmОчередьЗапросовЧатБота/ManagerModule.bsl
Функция ПоследнееСообщение(token, chat_id = 0, first_last_name = "", Сдвиг = 0) Экспорт 
	
	message = Новый Структура("update_id, chat_id, message_id, first_last_name, chat_text, bot_answer, user, state", 0, 0, 0, "",,,Справочники.Пользователи.ПустаяСсылка(),scmHTTPCервисыOpenAPIПовтИсп.СостоянияБота().Неопределено);
	
	Запрос = Новый Запрос;
	Если Сдвиг = 0 Тогда 
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	scmОчередьЗапросовЧатБотаСрезПоследних.update_id КАК update_id,
		|	scmОчередьЗапросовЧатБотаСрезПоследних.chat_id КАК chat_id,
		|	scmОчередьЗапросовЧатБотаСрезПоследних.message_id КАК message_id,
		|	scmОчередьЗапросовЧатБотаСрезПоследних.first_last_name КАК first_last_name,
		|	scmОчередьЗапросовЧатБотаСрезПоследних.chat_text КАК chat_text,
		|	scmОчередьЗапросовЧатБотаСрезПоследних.bot_answer КАК bot_answer,
		|	scmОчередьЗапросовЧатБотаСрезПоследних.user КАК user,
		|	scmОчередьЗапросовЧатБотаСрезПоследних.state КАК state
		|ИЗ
		|	РегистрСведений.scmОчередьЗапросовЧатБота.СрезПоследних(
		|			,
		|			token = &token
		|				И ВЫБОР
		|					КОГДА &chat_id = 0
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ chat_id = &chat_id
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &first_last_name = """"
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ first_last_name = &first_last_name
		|				КОНЕЦ) КАК scmОчередьЗапросовЧатБотаСрезПоследних";
	Иначе 
	Запрос.Текст = 
		 "ВЫБРАТЬ ПЕРВЫЕ 2
		 |	scmОчередьЗапросовЧатБота.Период КАК Период,
		 |	scmОчередьЗапросовЧатБота.token КАК token,
		 |	scmОчередьЗапросовЧатБота.chat_id КАК chat_id,
		 |	scmОчередьЗапросовЧатБота.message_id КАК message_id,
		 |	scmОчередьЗапросовЧатБота.update_id КАК update_id,
		 |	scmОчередьЗапросовЧатБота.first_last_name КАК first_last_name,
		 |	scmОчередьЗапросовЧатБота.chat_text КАК chat_text,
		 |	scmОчередьЗапросовЧатБота.bot_answer КАК bot_answer,
		 |	scmОчередьЗапросовЧатБота.user КАК user,
		 |	scmОчередьЗапросовЧатБота.state КАК state,
		 |	scmОчередьЗапросовЧатБота.error КАК error
		 |ИЗ
		 |	РегистрСведений.scmОчередьЗапросовЧатБота КАК scmОчередьЗапросовЧатБота
		 |ГДЕ
		 |	scmОчередьЗапросовЧатБота.token = &token
		 |	И scmОчередьЗапросовЧатБота.chat_id = &chat_id
		 |	И scmОчередьЗапросовЧатБота.first_last_name = &first_last_name
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	update_id УБЫВ"
	КонецЕсли;
	
	Запрос.УстановитьПараметр("token", token);	
	Запрос.УстановитьПараметр("chat_id", Число(chat_id));
	Запрос.УстановитьПараметр("first_last_name", first_last_name);
		
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(message, ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
	Возврат message;

КонецФункции

Процедура ДобавитьСообщениеВОчередь(token, log) Экспорт 
	
	Попытка
		НаборЗаписей = РегистрыСведений.scmОчередьЗапросовЧатБота.СоздатьНаборЗаписей();
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, log);
		Запись.Период = ТекущаяДата();
		НаборЗаписей.Записать(Ложь);
	Исключение
		отладка = 0;
	КонецПопытки;
	
КонецПроцедуры
